# LoadAttrForceScaleFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadAttrForceScaleFactor Property
ParameterTypeId Class See Also
---
"Force scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadAttrForceScaleFactor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadAttrForceScaleFactor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadAttrForceScaleFactor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace